IDEA Open Model
FoldedPlateData.Bends Property
Compatible with IDEA StatiCa v 10.1
 List of bends connected plates of foldedplate
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public List<BendData> Bends { get; set; }
Public Property Bends As List(Of BendData)
	Get
	Set
public:
property List<BendData^>^ Bends {
	List<BendData^>^ get ();
	void set (List<BendData^>^ value);
}
Property Value
Type: List<BendData>
See Also
Reference
FoldedPlateData Class
IdeaRS.OpenModel.Connection Namespace